In [8]:
import mysql.connector
from getpass import getpass
import pandas as pd

### 1. Establish a connection between Python and the Sakila database.

In [21]:
#establishing a connection to a database
password = getpass()

#cnx = variable
cnx = mysql.connector.connect(user = "root",
                             password = password,
                             host = "localhost",
                             database = "sakila")

cnx.is_connected()

········

True

In [22]:
#we need to define the object we will use to interact with mysql
cursor = cnx.cursor()

### 2.Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

- engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.
- month: an integer representing the month for which rental data is to be retrieved.
- year: an integer representing the year for which rental data is to be retrieved.

In [40]:
query = ("""SELECT * FROM sakila.rental
        WHERE rental_date LIKE '%2005-10%';""")
cursor.execute(query)

In [41]:
results = cursor.fetchall()
results

[]

In [42]:
columns = [x[0] for x in cursor.description]

In [43]:
rental= pd.DataFrame(results, columns = columns)
rental.head(3)

Empty DataFrame
Columns: [rental_id, rental_date, inventory_id, customer_id, return_date, staff_id, last_update]
Index: []

In [95]:
def rentals_month(year, month, engine):
    cnx = mysql.connector.connect(user = "root",
                             password = password,
                             host = "localhost",
                             database = f"{engine}")
    
    
    
    
    
    
    
    query = (f"""SELECT * FROM sakila.rental
        WHERE rental_date LIKE '%{year}-{month}%';""")
    
    cursor = cnx.cursor()
    cursor.execute(query)
    
    
    results = cursor.fetchall()
    columns = [x[0] for x in cursor.description]
    rental= pd.DataFrame(results, columns = columns)
    
    return rental

In [96]:
rentals_month("2005", "06", "sakila")

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
2306,3465,2005-06-21 22:10:01,1488,510,2005-06-30 21:35:01,1,2006-02-15 21:30:53
2307,3466,2005-06-21 22:13:33,371,226,2005-06-25 21:01:33,2,2006-02-15 21:30:53
2308,3467,2005-06-21 22:19:25,729,543,2005-06-27 00:03:25,2,2006-02-15 21:30:53
2309,3468,2005-06-21 22:43:45,2899,100,2005-06-30 01:49:45,1,2006-02-15 21:30:53
2310,3469,2005-06-21 22:48:59,4087,181,2005-06-28 19:32:59,1,2006-02-15 21:30:53

### 3 . Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".

In [97]:
def rental_count_month(year, month):
    df = rentals_month(year, month, "sakila")
    df_grouped = df.groupby(["customer_id"]).agg({"rental_id" : "count"})
    df_grouped = df_grouped.rename(columns={'rental_id': f'rentals_{month}_{year}'})
    
    return df_grouped

In [98]:
rental_count_month("2005", "07")

             rentals_07_2005
customer_id
1                         12
2                         14
3                         13
4                          5
5                         16
...                      ...
595                       19
596                        6
597                        7
598                       16
599                        7

[599 rows x 1 columns]

### 4. 
Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [100]:
def compare_rentals(df1, df2):
    y_1 = input("please enter the first year: ")
    m_1 = input("please enter the first month: ")
    y_2 = input("please enter the first year: ")
    m_2 = input("please enter the first month: ")
    
    
    
    
    df1 = rental_count_month(y_1, m_1)
    df2 = rental_count_month(y_2, m_2)
    
    df_diff = pd.merge(df1, df2, on='customer_id', how='left')
    df_diff["difference"] =  df2[f"rentals_{m_2}_{y_2}"] - df1[f"rentals_{m_1}_{y_1}"]

    return df_diff

In [99]:
y_1 = input("please enter the first year: ")
m_1 = input("please enter the first month: ")
y_2 = input("please enter the first year: ")
m_2 = input("please enter the first month: ")
    
    
    
    
df1 = rental_count_month(y_1, m_1)
df2 = rental_count_month(y_2, m_2)

KeyboardInterrupt: Interrupted by user

In [101]:
compare_rentals(df1, df2)

please enter the first year: 2005
please enter the first month: 06
please enter the first year: 2005
please enter the first month: 07

             rentals_06_2005  rentals_07_2005  difference
customer_id
1                          7               12         5.0
2                          1               14        13.0
3                          4               13         9.0
4                          6                5        -1.0
5                          5               16        11.0
...                      ...              ...         ...
595                        2               19        17.0
596                        2                6         4.0
597                        3                7         4.0
598                        1               16        15.0
599                        4                7         3.0

[590 rows x 3 columns]